import 'package:flutter/material.dart';
import 'Taranem.dart';
import 'Moqdma.dart';
import 'SendEmail.dart';
import 'Videos.dart';
import 'Zoxologia.dart';
import 'Program.dart';
import'sa3ba.dart';

class Utilities {
  Image background;
  Image env1;
  Image env2;
  Image env3;
  Image logo;
  Image splashScreen;
  Image seal;
  Image bg2;
  String Mawdo31;
  String Mawdo311;
  String Mawdo312;
  String Mawdo313;
  String Mawdo314;
  String Mawdo315;
  String Mawdo316;
  String Mawdo321;
  String Mawdo322;
  String Mawdo323;
  String Mawdo331;
  Image DrawerBG;
  String She3ar;
  String Askon;
  String E3zef;
  String Hkayat;
  String Dayman;
  String Ratel;
  String Salemt;
  String Tobaky;
  String Aly;
  String Almny_Antazerak;
  String Almny_Akon_sora;
  String Fr7an;
  String Feh_Wa7ed;
  String Fe_Youm;
  String Konty_Matro7a;
  String La_Ykon_Zalam;
  String Lam_Tara;
  String Lma_Snen;
  String Ya_Rab_E3mal;
  String Ya_Rabana_Yasou3;
  String Ya_Man_E7tawaytany;
  Map m;
  String Engel5edma1;
  String Qeta35edma1;
  String Engel5edma3;
  String Engel5edma2;
  var Qeta35edma2;
  var Qeta35edma3;
  var Zox;
  var time;
  Image pray;
  Image Book1;
  Image Book2;
  Image Book3;
  Image Book4;
  Image Book5;
  var music;
  var hrof;
  var eat;
  var drink;
  var music2;
  var eat2;


  MyDrawer(h, context) {
    return Drawer(
        child: Container(
          decoration: new BoxDecoration(
            border: new Border.all(color: Colors.black.withOpacity(0.5),width: 2.0),
            color:Color.fromRGBO(115, 18, 14, 1.0),
        ),
          child: ListView(
                  padding: EdgeInsets.zero,
                  children: <Widget>[
                    Container(height: 50.0,color:Color.fromRGBO(76,15,13,1.0) ,alignment: Alignment(1.0, 1.0),
                      child: Text("مؤتمر يا إبن أدم",style: TextStyle(color: Colors.white,fontWeight: FontWeight.w700,fontSize: 15.0),),),
                    GestureDetector(child:GetChild("عن المؤتمر"),onTap: (){Navigator.push(context, MaterialPageRoute(builder: (context) => Moqdma()));},),
                    Container(color: Colors.black,height: 2.0,),
                    GestureDetector(child:GetChild("البرنامج"),onTap: (){Navigator.push(context, MaterialPageRoute(builder: (context) => Program(0)));},),
                    Container(color: Colors.black,height: 2.0,),
                    GestureDetector(child:GetChild("ترانيم"),onTap: (){Navigator.push(context, MaterialPageRoute(builder: (context) => Taranem()));},),
                    Container(color: Colors.black,height: 2.0,),
                    GestureDetector(child:GetChild("الذكصولوجية"),onTap: (){Navigator.push(context, MaterialPageRoute(builder: (context) => Zoxologia()));},),
                    Container(color: Colors.black,height: 2.0,),
                    GestureDetector(child:GetChild("الكلمات الصعبة فى السفر"),onTap: (){Navigator.push(context, MaterialPageRoute(builder: (context) => Sa3ba()));},),
                    Container(color: Colors.black,height: 2.0,),
                    GestureDetector(child:GetChild("فيديوهات"),onTap: (){Navigator.push(context, MaterialPageRoute(builder: (context) => Videos()));},),
                    Container(color: Colors.black,height: 2.0,),
                    GestureDetector(child:GetChild("بريد الخدام"),onTap: (){Navigator.push(context, MaterialPageRoute(builder: (context) => SendEmail()));},),
                    Container(color: Colors.black,height: 2.0,),

                  ],
                ),
        ));
  }

  AppBar MyAppBar(title, size) {
    if (size == 0) size = 1.25;
    return AppBar(
      backgroundColor: Color.fromRGBO(76, 15, 13, 1.0),
      centerTitle: true,
      title: Row(
        textDirection: TextDirection.ltr,
        mainAxisAlignment: MainAxisAlignment.end,
        children: <Widget>[
          Container(
            child: Text(
              title,
              textScaleFactor: size,
            ),
            padding: EdgeInsets.symmetric(horizontal: 10.0),
          ),
          // only(left)
          this.logo,
        ],
      ),
    );
  }

  Utilities() {
    createMap();
    background = Image.asset(
      "assets/images/bg.jpg",
      fit: BoxFit.fill,
    );
    pray = Image.asset("assets/images/pray.png",);
    time = Image.asset("assets/images/time.png",);
    env1 = Image.asset("assets/images/env1.png");
    env2 = Image.asset("assets/images/env2.png");
    env3 = Image.asset("assets/images/env3.png");
    logo = Image.asset(
      "assets/images/logo.png",
      height: 45.0,
    );
    splashScreen = Image.asset(
      "assets/images/SplashScreen.jpg",
      fit: BoxFit.fill,
    );
    seal = Image.asset(
      "assets/images/seal.png",
      height: 92.0,
      width: 92.0,
    );
    bg2 = Image.asset("assets/images/bg2.png");
    DrawerBG =
        Image.asset("assets/images/DrawerBG.jpg", fit: BoxFit.fill,
          repeat: ImageRepeat.repeat,);
    Mawdo31 =
    "- مرثاة على ملوك يهوذا اللذين استعبدوا تابعيهم و أرعبوا شعوبهم.\n- اللبؤة الأم (هي العائلة الملكية - الأم المُرضِعة) ربت أولادها الملوك وسط الأشبال فتعلموا نفس أساليب الملوك المجاورين في ظلم شعوبهم ولم يعودوا بعد رعاة يرعون رعيتهم بل يأكلونها اذ لم يعودوا ملوكاً لخضوعهم للآخرين (ملوك مصر و بابل)";
    Mawdo311 =
    "خرب مدن شعبه و كان ظالماً شريراً و سقط في خطايا جسديه ثم اُمسك اثناء محاولة الهرب وفقأوا عينيه واقتيد أسيراً إلى بابل";
    Mawdo312 =
    "تعلم افتراس الفريسة. أكل الناس وعرف قصورهم وخرب مدنهم، فأقفرت الأرض وملؤها من صوت زمجرته (حز6:19&7)";
    Mawdo313 =
    "فاتفق عليه الأمم من كل جهة من البلدان، وبسطوا عليه شبكتهم، فأخذ في حفرتهم فوضعوه في قفص بخزائم وأحضروه إلى ملك بابل، وأتوا به إلى القلاع لكيلا يسمع صوته بعد على جبال إسرائيل.(حز8:19&9)";
    Mawdo314 =
    "تربي في اسره ملكيه تعلم الحرب ولكنه عوض عن ان يحارب لحمايه شعبه حاربهم لياكلهم و صار يعمل لحساب ذاته";
    Mawdo315 = "تعلم افتراس الفريسة. أكل الناس .(حز3:19)";
    Mawdo316 = "أخذ في حفرتهم، فأتوا به بخزائم إلى أرض مصر. (حز4:19)";
    Mawdo321 =
    "1-ترمز للمسيح : 'أنا الكرمة وأنتم الأغصان' (يو 15 : 5) ،'أنا الكرمة وأبى الكرام'( يو 15 : 1)\n2-ترمز للسيدة العذراء : الكرمة الحقانية الحامله عنقود الحياه (من صلوات الأجبية).\n3-ترمز للكنيسة : أنظر وتعهد هذه الكرمة التى غرستها يمينك (لحن أيها الرب إله القوات)\n4-ترمز للزوجة : 'إمرأتك تكون كالكرمة التى تثمر فى جوانب بيتك' (مز 128 : 3)\n5-ترمز لشعب الله : 'كرمة من مصر نقلت' (مز 80 : 8 – 13 )";
    Mawdo322 =
    "- الكرمه بين الأشجار الآخرى تعتبر لينه العود لا يصلح خشبها لشئ ولا حتى كوقود إذ تلتهمها النار بكليتها فى لحظات ولا حتي يمكن عمل وتد (مسمار صغير) منه، إن ميزتها الوحيدة تقريباً هى الثمر المتكاثر فإن لم تثمر لا تصلح لشئ بالمره ، يمكن فقط أن يستخدم كوقود في النار.\n- أما شجر الوعر فهو بلا ثمر ولكن يمكن إستخدام أخشابة في صناعة الأثاث.\n- و يرمز عود الكرم إلى شعب إسرائيل ، هكذا كانت الوظيفة الوحيده التى كان يجب أن يقوموا بها فشلوا فيها (عباده الله وتسبيحه) وهذا ما حدث ، خان الشعب الله وإرتدوا عنهم ، فسلمهم للسبى.\n- و يوضح لنا مثل الكرم زيف وبطلان رجاء شعب بنى إسرائيل فى النجاه ، حيث هذا الشعب (الكرمة) الجميلة الذى أخرجها الله من أرض مصر وغرسها فى الأرض التى وعدهم بها ، كلهم أصبحوا كالكرمة الغير مثمرة ، التي تعطي أغصاناً يابسة جافة بلا عمل لا تصلح لشئ بالمرة ، فبدون الإتحاد بالله نصبح أغصاناً منفصلة عن الأصل";
    Mawdo323 =
    "إذن فلنراجع حياتنا ونسأل أنفسنا\nهل نحن بإتحاد مع المسيح حقا ؟ \nهل نتكل عليه في نمونا الروحي كالأغصان المعتمدة على الكرمة في الغذاء والماء ؟ \nهل هناك أثمار في حياتنا ؟ \nالسيد المسيح يدعونا لنفرح معاً إذ إننا الأغصان في الكرمة\nوالأغصان المثمرة تلفت الأنظار اليها";
    Mawdo331 =
    "- كائنات سمائية عالية الكرامة\n- طاهرة ونقية وتسير في طاعة اله تماماً ( كمنظر النحاس الامع من وسط النار ) ( حز 1 : 4)\n-بتشوف في كل الإتجاهات ( لكل واحد أربعة أوجه) ( حز 1 : 6) وهذا يليق لمن يقف أمام الله \n- وظيفتها الأساسية العبادة  والتطلع إلى الله والخدمة  ( وأيدي إنسان تحت أجنحتها ) ( حز 1 : 8) \n- وجودها الأساسي في محضر الله ( راكضة وراجعه ) (حز1 : 14)\n- عددهم أربعة وهذا يشير إلي قدرة الله علي سيطرته على 4 جهات المسكونه\n-الأربعة كائنات تشير إلى :";
    She3ar =
    "مشتاق ان اري سمائك وسط المرارة في ارض السبي \nكشفت لنبيك عن عرشك . أدرك ربي انك حي\n(صانع التاريخ بحكمتك أكشف لي عن أسرارك \nفأطمئن اني محمول ، محمول علي ذراعك)2\n(و أنا مشتاق و أنا مشتاق  ، مشتاق ان اري سماءك)2\nهب لي عيوناً من كل جانب ، فأصير كلي وجهاً لك \nأري السماء فأشتاق إلي الرحيل لسمائك \n(أري نور وجهك فأصير نوراً و أستنير بك )2\n\n\n\n";
    Askon =
    "1- اسكن تحت ظل جناحيك اعرف معني السلام في حبك\nسيحل الظلام لكنني لن أخاف تحت ظل جناحيك\n\nالقرار- (تحت ظل تحت ظل تحت ظل\nجناحيك)*2\n\n2-  اطمئن في ظل جناحيك أجد كل الأمان في سترك\nكم من سهم يطير لكنني لا أخاف تحت ظل جناحيك\n\n";
    E3zef =
    "اعزف بحياتك لحن جميل  خليك ذكرى خليك فكرى\n او حتى دليل خليك شمعة تنور فترة بس بصدق\n بدون تضليل:) \nحتى ان كانت قاسية وصعبة هى حياة والكل نزيل\n عيشها وسيب الحانك فيها بكرة نكون فاكرينك بيها\n \” ذكرى الصديق فرحة وتهليل \”\n";
    Hkayat = "(حكايات العدراء معروفة و طاهرة عجائبها في كل مكان دي ليها شهرة)2 \nكان متياس مسجون و السجن بعيد \nو بشفعات الحنون ذاب الحديد \nكنيستها الل في اتريب كان هيهدوها \nجابت منشور عجيب في الحال تركوها \n لما جبل المقطم نادوا سمعان \nجنب صلاة امنا مريم ام الحنان \nوظهورها باجلى بيان كان في الزيتون\n ناس من كل الاديان شافوا البتول";
    Dayman =
    "القرار - (دايماً بتخبيني لما تهب الريح بجناحك\n تداريني وعدك وعد صريح)2\n1- (لما الناس تنساني واشعر إني وحيد \nأصرخ لك في مكاني تيجي بحب أكيد)2\n(وتنسيني وتعزيني)2 .. يا يسوع\n2- (لما الناس تحاربني بالإيمان القاك \nصوتك ينده إبني أجري وابات في حماك)2\n(وتنسيني وتعزيني)2 .. يا يسوع\n3- (لما الناس بتهيني وارجع وانا مجروح \nبصليبك بتعيني ويشجعني الروح)2\n(وتنسيني وتعزيني)2 .. يا يسوع\n";
    Ratel =
    "القرار\nرتل مزاميرك وإفرح .. إفرح ويانا يا داوود\nإهتف من قلبك إهتف وإعزف ألحانك على العود\n  1- الرب نورى وخلاصى ورافع راسى على الأعداء\nلو جيش الشر حاربنى عمرى ما أخاف دا أنا عندى رجاء\nلو حتى الحوت يبلعنى ولو ينفونى عن الأنباء\nوإن سرت فى وادى ظل الموت ما باخافش وأنا المقصود \n 2- طوبى للرجل الذى لم يسلك فى مشورة الأشرار\nلكن فى ناموس الرب مسرته يلهج ليل ونهار\nفيكون كالشجرة المغروسة تثمر على مجرى الأنهار\nوكل ما يصنع ينجح فيه وما فيش لنجاحه حدود\n3- أعداء الخير إتلموا وغيظهم زى الشوك فى النار\nنصبوا لى الفخ إحتالوا علىَّ وكانوا علىَّ كتار\nإنكسر الفخ ووقعوا فى بير والبير ده ملهوش قرار\nوأهو شاول وسط جنوده مات ما بقاش لسيرته وجود\n\n";
    Salemt =
    "1- سلمت نفسي في يديك ياسيدي يسوع\nقدني فتكلاني عليك كي أخدم الجموع\nكن حارسي من الضلال كن مرشدي في كل حال\nوالقلب قدس والفعال حتى آرى يسوع\n\nالقرار - قد قلت قبل الآن يامنبع الإحسان\nيا متعب القلب تعال اريحك من الأسقام\nوالمجد أيضاً ستنال معي أنا يسوع\n\n2- ربي آمتلكني واروني من نبعك الملان\nادعوك فاسمع واهدني للخير يا منان\nكيما أعود من جديد اسعى واطلب المزيد\nمن نعمة العهد الجديد حتى أرى يسوع\n\n3-ان نغصت عيشي الهموم أو إن دنا الظلام\nستنجلي كل الغيوم من مانح السلام\nالرب حصني والأمل الرب إن قال فعل\nوالحب فيه مكتمل لذا أرى يسوع\n";
    Tobaky =
    "القرار : طوباك يا مريم يا عصا هارون\nيا قبة موسى وشورية هارون\n\nمجدك يا مريم أرفع من السماء\nولدت لنا المخلص وأعطاك كل بهاء\n\nمجدك يا مريم فاق السمائيين\nعليتي على الشاروبيم أيضاً على السيرافيم\n\nمجدك يا مريم كائن فى العلا\nلأنك عرش الله جاء وأعطانا الفداء\n\nمجدك يا مريم من عبر الأجيال\nأنت السما الثانية أم الله الديان\n";
    Aly =
    "عالى لفوق أنا رافع إيدى عندك ملكى وعزى وسيدى\n(وبعز أنا مش عاوز حاجة إن كانت مش راح ترضيك)2\n(أبدًا ابدًا ولايغنينى ولايشبع قلبى ويروينى\nولا يملى عينى ويكفينى غير بس اللى تجود بيه إيديك)2\n\nماشى فى السكة بفرحة وبأعلن إنت يا صاحب المذبح تعلن\n(تأكل جسدى وتشرب دمى تثبت فى وأثبت فيك)2\n(أبدًا أبدًا مش مستنى حد من الدنيا يطمنى\nأو مسنود على غيرك لكن هيكون سندى كله عليك)2\n\nرافع عينى بحب لحضنك برجاء توبة فيه غفران\n(راجع راجع لكنيسة حية فيها أتعلم أشهد ليك)2\n(أبدًا أبدًا مش متساب وحدى هنا فى دنيا الأتعاب\nمليان قلبى سلام من وعدك رب المجد بذاته حاميك)2\n\n";
    Almny_Akon_sora =
    "علمني يا رب أكون صورة تعكس للعالم نورك \nبتداوي الناس المكسورة و ترجعهم لحصونك \nعلمني ازاي اكون خادم و ازاي اجذب ملايين\nعلمني أوصل الكلمة و ازاي أغسل رجلين \nعلمني ان انت اللي بتخدم و اني مجرد انسان \nمهما هيعمل جوة الخدمة يختفي و انت هتبان \nعلمني ازاي وقت سكوتك قلبي يكون واثق فيك \n(و ازاي يا رب تكون خدمتي بما يليق )2\n";
    Almny_Antazerak =
    "1-علمني أنتظرك يا رب عرفني رؤيتك للدرب\nفليس لي سواك أنت سَندي و روحك يقودني\nوكلامك سراجي\n\n2-لذذني بحبك الغني و قدني بنورك السني\nفحبك أعظم طوق للنجاة نبع رجائي في الصلاة\nكل أمالي في الحياة\n\n3-يا ربي أنر لىَّ عيني يا ربي أفتح لي قلبي\nلكي أري ذراعك تحيط بي و صدرك يضمني\nو شخصك يعتني بي\n";
    Fr7an =
    "1- فرحان بيك وانا ماشى معاك فى طريقك أنا بستناك\n ولو انت اديتنى الحريه انا بختار افضل وياك\nالقرار - يللى مراحمك دى أبدية شايلانى بعطف وحنية\n وانا ماسواش أبداً وبقولك نعمتك دى يارب غنية\n الأعمى بيشوف النور والمذدرى م الناس مقبول \nوالخاطى لما بيتألم ترفعه بإيدك على طول\n2- وقت الخطر انت معلمنى أفضل ثابت فيك مع إنى\n لما بشوف الموجه بتعلى روحى ياربى بتهرب منى\n3- كل ما اشوف صورتى المكسورة وعيوبى جوايا محفوره\n ألاقيك بتجمل وبترسم بتشكلنى فى أجمل صورة\n4- فى الضيقة وجدتلى المخرج ووعدتنى م الحزن راح اخرج\n دى مراحمك قويه ياربى الصعب ده قدامها بيفرج\n\n";
    Feh_Wa7ed =
    "القرار: في واحد بيحبك .. بيخبط علي قلبك\nخليه يملك عمرك .. سلم قلبك ليه\nكلمه تلقاه سمعك .. حاسس بيك وبضعفك\nهو الخالق ربك .. شايلك جوه عنيه\n\nيفرح لو تناديله .. لو تقرأ انجيله\nمن قلبك صلي له .. وارمي الحمل عليه\nلو حسيت بالوحده .. واتألمت بشده\nربك صوته بينده .. روح اتعرف بيه\n\nربنا وعده اكيد .. لو يبقي لك سيد\nيديك عمر جديد .. والشر هيمحيه\nليه تايه متغرب ؟ .. ليه من الحب بتهرب ؟\nليه من الدنيا بتشرب ؟ .. شبعك موجود فيه ؟\n\nتحتار ليه وتستغرب .. حاول بس وجرب\nروح للفادي وقرب .. جرحك راح يشفيه\nروح اوصف له ظروفك .. ضعفك وسنين خوفك\nجوه الضلمه يشوفك .. ويشيلك بايديه\n";
    Fe_Youm =
    "في يوم مريت علي شفت قيودي في إيدي\nوأنا شفت بعيني دموع مالية عينيك\nوفي يوم مريت عليك شفت قيودي في إيديك\nحر والفضل ليك ملت الدموع عيني\n\n(سألتك قد إيه دفعت يارب في\nكتير لكنه يا ابني ماهوش كتير عليك)2\n\nواليوم هاتمر بي تسألني عن الحرية\nشاعر بالعبودية مع إني حر فيك\nهمومي مقيداني في حب عالم فاني\nباشوف فين فيك مكاني وناسي إني ليك\n\n(حر لكني عبدك ملكك بطول زماني\nعبدك لكني ابنك لما اخضع بين إيديك)2\n\n";
    Konty_Matro7a =
    "(كنت مطروحة بلا راع أو امان كنت مدوسة بدماء وهوان)2\nكنت عريانة بلا ستر أو غطاء وتبحثين عن سلام وعزاء\n\nالقرار : فمررت بك ورأيتك وإذا بزمانك زمن الحب\nفبسطت ذيلي عليك وسترتك\nودخلت معك في عهد فصرت لي\n(بحثت عنك كنت في وضع رهيب ومشيت درباً من أجلك للصليب)2\nوبسفك دمائي منحتك الفداء أنت كنيستي انت عروس السماء\n\n";
    La_Ykon_Zalam =
    "القرار - لا يكون ظلام للي عايش جوه ضيق\nويكون سلام وايديه تفتح طريق\n1- من جوه نعشي سمعت صوته ينادي اسمي\nوبكلمه منه رد روحي جوه جسمي\n\n2- وأقوم وانا رافع عيني لعينه\nولا ايد بتسند أو تساعد غير ايديه\n\n3- أنا كلي ليك يا لي بدمك اشترتني\nولا يكفي حبي وخدمتي يالي فديتني\n";
    Lam_Tara =
    "(لم تر عين الها غيرك يفتح السجن وينزع القيود)2\nويشق الغمر فاذا طريق لا تعوقه جبال وسدود\nالقرار:\nلم تر عين الها غيرك لم تر عين الها غيرك\n\n(من سواك يتراءى في الأتون أوينجى النفس من جب الأسود)2\nمن ينير القفر إن حل الظلام بلهيب حب في صورة عمود\n\n(كم تألمت على عود الصليب كي تعد لي مكانا في الخلود)2\nووعدتنى ستأتي عن قريب وتهبنى ثقل مجد بالصعود\n";
    Lma_Snen =
    "1-(لما سنين بتعدي علينا و الأحداث حوالينا تمر \nلو بصينا ورانا هنلقي انت شايلنا طول العمر)2\nعمر إيديك ما سابت إيدينا حتي في وقت قساوة القلب\nوقت غشاوة الشر ما تعمي كنت حقيقي تضم كأب\nالقرار :أب بيفهم ضعف ولاده و تمردهم حتي عليه \nلكن كنت تنادي عليهم و الندمان بتجري إليه \nو لأنك داري بمشاعرنا ولا يوم لُمت و لا عايرت \nتمسح بحنان كل دموعنا و علي ابوابنا ياما سهرت  \n2-(كل الحب ده غطي علينا و ستر كل عيوبنا برحمة \nو فتحلنا من تاني عنينا خرجنا لنور بعد الضلمة)2 \nو سمحتلنا بفرصة جديدة لحياة كل هدفها سماك\nعارفين ان الأرض محطة ، ان وطنا حقيقي معاك\n3-(علشان كدة مهما إللي هيجي احنا ولادك مش هنخاف\nواثقين انه بيك نصرتنا و فيك قوتنا لو احنا ضعاف )2\nنفضل طول مسيرتنا نرنم نشهد لإسمك رب الكون \nانت ابونا و روحك فينا و سلامنا معاك اكيد مضمون\n\n\n";
    Ya_Rab_E3mal =
    "القرار:يا رب أعمل من اجل أسمك ليس لكونى بارٌ فى عينك\nلتكن عيناك مفتوحتان واذناك مصغيتان الى صوت تنهد شعبك\n1-ادينا يارب أنت الإيمان نشوف خلاصك على الدوام\nحتى لو كان فى أتون النار حتى لو كان فى عمق البحار\nعظيم عملك يفوق الخيال\n\n2-نترك الجرار عند الأبيار نبشر بخلاص اله جبار\nهزم الموت كسر القيود وقام من القبر بكل انتصار\n\n3-ليس لنا ليس لنا يارب نحوك عيوننا\nارحم شعبك عظم لطفك وبنعمتك سهل سبلك\n";
    Ya_Rabana_Yasou3 =
    "1-يا ربنا يسوع ليس لنا سواك \nفي عالم الدموع نعيش في حماك\nفي عطش أو جوع تشبعنا من رضاك \nليس لنا ينبوع ليس لنا سواك\n2- يا ربنا الحبيب العالم في هياج\n بقوة الصليب أحطنا بالسياج\nوحبك السكيب فنحن في احتياج \nندعوك فتجيب ليس لنا سواك\n3-يا ربنا العظيم إن كنا خاطيين \nأنت هو الرحيم ونحن مذنبين\nجبلتنا من قديم ولسنا كاملين\n لكنك تهيم في حب التائبين\n4-يا ربنا الوديع أنت لنا صديق \nفي قسوة الحياة أنت لنا رفيق\nأعنا يا يسوع أنر لنا الطريق \nإننا في احتياج لوعدك الوثيق\n";
    Ya_Man_E7tawaytany =
    "1- يا من أحتويتني في جراحك هناك\n وحصرتني في أسر حبك يا من فداك\nكان من أجل نجاتي إذ نزيف من دماك\n غسل عيب فؤادي ضامني من الهلاك\nالقرار - (في انتظارك أغني لحن أشواق اللقاء\nحتي ذا اليوم سأحيا أعلن حب السماء)2\n\n2- يا من إشتريتني دافعاً أغلى حساب \nدافعاً جزاء جرمي حاملاً عني العقاب\nكيف أوفيك وليس عندي فأنا التراب\n كيف أوفيك وديني كيف يوفيه حساب\n3- ربي وعدك ستعطي قوة من عندك \nفي الشدائد معيناً قد وجدت شخصك\nوتعزيني فأنسي ضعفي ناظراً لك \nفاملأن بالروح قلبي حتى أحيا ملكك\n";
    this.Engel5edma1 = "حينئذ، يشبه ملكوت السموات عشر عذارى أخذن مصابيحهن وخرجن لاستقبال العريس. خمس منهن كن جاهلات وخمس حكيمات. فأخذت الجاهلات مصابيحَهن ولم يأخذن معهن زيتا. وأما الحكيمات فأخذن زيتا في آنيتهن مع مصابيحهن. ولما أبطأ العريس نعسن كلهن ونمن. ولما انتصف الليل صار صراخ: هوذا العريس قد أقبل فقمن وأخرجن للقائه. حينئذ قامت أولئك العذارى جميعا وزين مصابيحهن. فقالت الجاهلات للحكيمات أعطيننا من زيتكن فإن مصابيحنا تنطفئ. فأجابت الحكيمات قائلات: لعله لا يكفينا وإياكن، فاذهبن بالحري إلى الباعة وابتعن لكن. فلما ذهبن ليبتعن جاء العريس والمستعدات دخلن معه إلى العرس وأغلِق الباب. وأخيرا جاءت بقية العذارى أيضا قائلات: ربنا ربنا افتح لنا. أما هو فأجاب وقال: الحق أقول لكن إني لا أعرفكن. فاسهروا إذن لأنكم لا تعرفون اليوم ولا الساعة التي يأتي فيها ابن الإنسان (والمجد لله دائما).";
    this.Engel5edma2 = "ثم سأله أحد الفريسيين أن يأكل معه. فلما دخل بيت الفريسي اتكأ. وإذا امرأة في المدينة كانت خاطئة. فلما علمتْ أنه متكئ في بيت الفريسي، أخذت قارورة طيب ووقفتْ من ورائه عند رجليه باكية، وبدأت تبل قدميه بدموعها وتمسحهما بشعر رأسها، وكانت تقبل قدميه وتدهنهما بالطيب. فلما رأى الفريسي الذي دعاه ذلك قال محدثا نفسه: لو كان هذا نبيا لعلم من هي هذه المرأة التي لمسته، وما حالها، إنها خاطئة. فأجاب يسوع وقال له: يا سمعان عندي كلمة أقولها لك. فقال: قل يا معلم. قال: كان لدائن مدينان على الواحد خمسمائة دينار وعلى الآخر خمسون، وإذ لم يكن لهما ما يوفيان سامحهما كليهما. فمن منهما يحبه أكثر؟ أجاب سمعان وقال: أظنُّ الذي سامحه بالأكثر. فقال له: بالصواب حكمتَ. ثم التفت إلى المرأة وقال لسمعان: أترى هذه المرأة؟ دخلتُ بيتك وماء لرجلي لم تعطِ، أما هي فقد غسلتْ بالدموع رجلي ومسحتهما بشعرها. لم تقبل فمي، أما هي فمنذ دخلتُ بيتك لم تكف عن تقبيل قدمي. بزيت لم تدهن رأسي، أما هي فقد دهنت بالطيب قدمي. من أجل ذلك أقول لك إن خطاياها الكثيرة مغفورة لها، لأنها أحبت كثيرا. والذي يغفر له قليل يحب قليلا. ثم قال لها: مغفورة لك خطاياك. فبدأ المتكئون يقولون في نفوسهم: من هو هذا الآخر الذي يغفر الخطايا؟! فقال للمرأة: إن إيمانك قد خلصكِ، فاذهبي بسلام (والمجد لله دائما.)";
    this.Engel5edma3 = "لا تخف أيها القطيع الصغير، فإن أباكم قد سر أن يعطيكم الملكوت. بيعوا أمتعتكم وأعطوا صدقة، واصنعوا لكم أكياسا لا تبلى، وكنزا في السموات لا يفنى، حيث لا يدنو منه سارق ولا يفسده سوس. لأنه حيث يكون كنزكم، هناك يكون قلبكم أيضا. لتكن أحقاؤكم ممنطقة ومصابيحكم موقدة وأنتم أيضا تشبهون أناسا ينتظرون سيدهم، متى يرجع من العرس، حتى إذا جاء وقرع يفتحون له للوقت. طوبى لأولئك العبيد الذين إذا جاء سيدهم يجدهم ساهرين. الحق أقول لكم إنه يتمنطق ويتكئهم ويقوم فيخدمهم. وإذا جاء في الهزيع الثاني أو جاء في الهزيع الثالث ووجدهم يصنعون هكذا، فطوبى لأولئك العبيد. وهذا اعلموه: أنه لو كان رب البيت يعلم في أية ساعة يأتي السارق، لكان يسهر ولا يدع بيته يُنقب. فكونوا أنتم أيضا مستعدين. فإنه في ساعة لا تعرفونها يأتي ابن الإنسان.\nفقال له بطرس: يا رب ألنا قلتَ هذا أم قلته للجميع ؟ فقال الرب: من هو الوكيل الأمين الحكيم الذي يقيمه سيده على عبيده ليعطيهم طعامهم في حينه ؟ طوبى لذلك العبد الذي إذا جاء سيده يجده يفعل هكذا. حقا أقول لكم إنه يقيمه على جميع أمواله. ولكن إن قال ذلك العبد الرديء في قلبه إن سيدي يبطئ في قدومه، فيبدأ يضرب العبيد والإماء ويأكل ويشرب ويسكر، يأتي سيد ذلك العبد في اليوم الذي لا يتوقعه وفي الساعة التي لا يعرفها، فيشقه من وسطه، ويجعل نصيبه مع عديمي الإيمان (والمجد لله دائما)";
    this.Qeta35edma1 = "- ها هو ذا العريس يأتي في نصف الليل، طوبى للعبد الذي يجده مستيقظا. أما الذي يجده متغافلا، فإنه غير مستحق المضي معه. فانظري يا نفسي لئلا تثقلي نوما، فتلقي خارج الملكوت. بل اسهري واصرخي قائلة: قدوس قدوس قدوس أنت يا الله، من أجل والدة الإله ارحمنا.\n\n- تفهمي يا نفسي ذلك اليومَ الرهيب واستيقظي، وأضيئي مصباحك بزيت البهجة. لأنك لا تعلمين متى يأتي نحوك الصوت القائل: ها هو ذا العريس قد أقبل. فانظري يا نفسي لا تنعسي، لئلا تقفي خارجا قارعة مثل الخمس العذارى الجاهلات، بل اسهري متضرعة لكي تلتقي المسيح الرب بدهن دسم، وينعم عليك بعرس مجده الإلهي الحقيقي\n\n -أنت هي سور خلاصنا يا والدة الإله العذراء الحصن المنيع غير المنثلم أبطلي مشورة المعاندين، وحزن عبيدك رديه إلى فرح وحصني مدينتنا وعن ملوكنا حاربي، وتشفعي عن سلام العالم، لأنك أنت هي رجاؤنا يا والدة الإله\n\n-أيها الملك السمائي المعزى، روح الحق، الحاضر في كل مكان والمالئ الكل، كنز الصالحات، ومعطى الحياة، هلم تفضل وحل فينا، وطهرنا من كل دنس أيها الصالح، وخلص نفوسنا.\n\n-كما كنت مع تلاميذك أيها المخلص  وأعطيتهم السلام، هلم أيضا كن معنا وامنحنا سلامك وخلصنا ونج نفوسنا.\n\n -إذا ما وقفنا في هيكلك المقدس نحسب كالقيام في السماء. يا والدة الإله، أنت هي باب السماء، افتحي لنا باب الرحمة.";
    this.Qeta35edma2 = "-أعطني يا رب ينابيع دموع كثيرة، كما أعطيت منذ القديم للمرأة الخاطئة. واجعلني مستحقا أن أبل قدميك اللتين أعتقتاني من طريق الضلالة. وأقدم لك طيبا فائقا، وأقتني لي عمرا نقيا بالتوبة. لكي أسمع أنا ذلك الصوت الممتلئ فرحًا: إن إيمانك خلصك\n\n-إذا ما تفطنت في كثرة أعمالي الرديئة ويأتي على قلبي فكر تلك الدينونة الرهيبة تأخذني رعدة، فأهرب إليك يا الله محب البشر. فلا تصرف وجهك عني، متضرعا إليك يا من أنت وحدك بلا خطية، أنعم على نفسي المسكينة بتخشع قبل أن يأتي الانقضاء وخلصني\n\n-السموات تطوبك أيتها الممتلئة نعمة، العروس التي بلا زواج. ونحن أيضا نمجد ميلادك غير المدرك. يا والدة الإله يا أم الرحمة والخلاص، تشفعي من أجل خلاص نفوسنا\n\n-أيها الملك السمائي المعزى، روح الحق، الحاضر في كل مكان والمالئ الكل، كنز الصالحات، ومعطى الحياة، هلم تفضل وحل فينا، وطهرنا من كل دنس أيها الصالح، وخلص نفوسنا.\n\n-كما كنت مع تلاميذك أيها المخلص  وأعطيتهم السلام، هلم أيضا كن معنا وامنحنا سلامك وخلصنا ونج نفوسنا. \n\n-إذا ما وقفنا في هيكلك المقدس نحسب كالقيام في السماء. يا والدة الإله، أنت هي باب السماء، افتحي لنا باب الرحمة.";
    this.Qeta35edma3 = "- بعين متحننة يا رب انظر إلى ضعفى، فعما قليل تفنى حياتي، وبأعمالي ليس لي خلاص. فلهذا أسال: بعين رحيمة يا رب انظر إلى ضعفى وذلي ومسكنتي وغربتي، ونجني.\n\n- بما أن الديان حاضر، اهتمي يا نفسي وتيقظي وتفهمي تلك الساعة المخوفة. فإنه ليس رحمة في الدينونة لمن لم يستعمل الرحمة. فلهذا أشفق عليّ أيها المخلص، فإنك أنت هو محب البشر وحدك\n\n- يا باب الحياة العقلي، يا والدة الإله المكرمة، خلصي الذين التجأوا إليك بإيمان من الشدائد، لكي نمجد ميلادك الطاهر في كل شئ من أجل خلاص نفوسنا.\n\n- أيها الملك السمائي المعزى، روح الحق، الحاضر في كل مكان والمالئ الكل، كنز الصالحات، ومعطى الحياة، هلم تفضل وحل فينا، وطهرنا من كل دنس أيها الصالح، وخلص نفوسنا.\n\n- كما كنت مع تلاميذك أيها المخلص  وأعطيتهم السلام، هلم أيضا كن معنا وامنحنا سلامك وخلصنا ونج نفوسنا.\n\n- إذا ما وقفنا في هيكلك المقدس نحسب كالقيام في السماء. يا والدة الإله، أنت هي باب السماء، افتحي لنا باب الرحمة.\n\n\n\n";
    this.Zox = "+ بي افتو ان زوؤون ان اسوماتوس : ات فاي خا بي هارما انتي افنوتي اوهو اموي نيم اوهو اماسي : اوهو ان رومي نيم اوهو ان ايتوس \n\n+أووه اون افميه فال : هي اتهي نيم هى فاهو امو : سو انتينه امبي اواي : نيم سو ان تينه امبيك اواي  \n\n+خين اسناف اف هوبس انوهو : خين اسناف اف هوبس إنو اتشالافج : اف هيل ذي خين بيك اسناف : افؤش ايفول افجو اموس  .  \n\n+جي اكؤواب اووه اكؤواب: اكؤواب ابشويس صاباؤث: اتفي نيم ابكاهي ميه ايفول :خين بيك اوؤو نيم بيك تايو\n\n+ انون ذي هون تين هوس نيموؤو: خين هان اسمي ان اتكارؤو : جي اجيوس اجيوس :اجيوس او كيريوس\n\n+ اريب ريسفافين : اوبي افتو انزؤون ان اسوماتوس : ان ليتورغوس ان شاه ان اكروم: انتيف كانين نوفى نان إيفول";
    this.Book1 = Image.asset("assets/images/Book1.png");
    this.Book2 = Image.asset("assets/images/Book2.png");
    this.Book3 = Image.asset("assets/images/Book3.png");
    this.Book4 = Image.asset("assets/images/Book4.png");
    this.Book5 = Image.asset("assets/images/Book5.png");
    this.music = Image.asset("assets/images/music.png");
    this.music2 = Image.asset("assets/images/music2.png");
    this.hrof = Image.asset("assets/images/hrof.png");
    this.eat = Image.asset("assets/images/eat.png");
    this.drink = Image.asset("assets/images/drink.png");
    this.eat2 = Image.asset("assets/images/eat2.png");
  }

  GetChild(x) {
    return Container(
      color: Colors.white.withOpacity(0.2),height: 50.0,
      alignment: Alignment(1.0, 0.0),
      padding: EdgeInsets.all(8.0),
      child: Text(x,style: TextStyle(color: Colors.white,fontSize: 20.0),),
    );
  }

  var map1 = new Map<String,String>();
  var map2 = new Map<String,String>();

  void add(String s, String t, String u) {
    map1[s]=t;
    map2[s]=u;
  }


  createMap(){
  add("دخناً" , "4 : 9" , " ذرة بيضاء");
  add("كرسنة", "4 : 9" , "عشب يصلح علفاً للدواب");
  add("خثي" ,"4  : 15" , " روث");
  add("شمساتكم","6 : 4" , "الهياكل التي يعبدون فيها الشمس");
  add("غبياء","	6 : 13" ," ملتفة وكثيفة");
  add("جنفاً" ,  "9 : 9" , "إنحراف وفساد وخطية");
  add("أهبة الجلاء"  , "12 : 4", "الخارجين إلى الجلاء ");
  add("الثغر","13 : 5", "فتحة");
  add("يملطون", " 13 : 10" ,  "طلاه – دهنه (بالأسمنت أو الطين)" );
  add("الطفال",	"13 : 10	" ,"التبيض بالمحارة");
  add("مخداتكن","13 : 21" , "عصائب يربطها الناس على رؤوسهم ");
  add("أثكلوها","14 : 15	" , "فقدوها");
  add("التخس", "16 : 10", "الحذاء");
  add("بزا", "ً	16: 10	", "نوع من أنواع الثياب");
  add("خذامة","	16 : 12	","حلقة من الشعر توضع في ثقب أنف البعير");
  add("تهاويل","17 : 3	","متعددة الألوان");
  add("خراعيبة","17 : 4	","الغصون الطاويلة الناعمة");
  add("الحصرم","18 : 2	", "ثمار العنب التي يتم قطفها قبل بداية النضج");
  add("ضرست","18 : 2	","ألم بالأسنان نتيجة حركتها بشدة تجاه بعض");
  add("معتنفا","	18 : 10	","عنيفاً في كسر الوصية");
  add("التيمن","	20 : 45	", "أي الجنوب إشارة لأرض فلسطين");
  add("الحقوين","21 : 6	","مثنى حق وهي المنطقة التي أعلى عظمة الفخذ");
  add("الترافيم","21 : 21	", "تماثيل ألهه تستشار في المقترحات");
  add("مجانق","21 : 22	","آلة قديمة من آلات الحصار , ترمي بها حجارة ثقيلة على الأسوار فتهدمها");
  add("زغلاً","	22 : 18	", "رغوة المعادن , النفاية أو الشوائب التي في المعادن");
  add("ترائب", "23 : 3	", "عظام القفص الصدري");
  add("أهوله","23 : 4	", "خيمتها – تشير للأمم");
  add("أهوليبه", "23 : 4	", "خيمتي – تشير لشعب بني إسرائيل");
  add("زنجارها", "24 : 6" , " صدأ النحاس الذي يتكون على جدرا القدر");
  add("ضح", "	24 : 7	" , "قمة");
  add("صيرهم","25 : 4	" , "خيامهم");
  add("مناخاً", "	25 : 5	", "إصطبل");
  add("مثغورة", "26 : 10", "بها فتحات");
  add("مجاذيفك" , "27 : 6" , "مجداف السفينة");
  add("البقس", "27 : 6" , "شجر خشبة صلب يصنع منه الأدوات");
  add("قلافوك" ,"27 : 9	", "الذين يلصقون الواح السفن يالقار (الزفت) ");
  add("منيت" ,"	27 : 17	" , " لم تنجح – فشلت");
  add("بلسان", "27 : 17	", "شجر له زهر أبيض صغير");
  add("سليخة" , "27 : 19" , "دهن ثمرة");
  add("الذريرة", "27 : 19", "عطر طيب الرائحة");
  add("طنافس", "27 : 20" , "البساط");
  add("دلب", "	31 : 8	", "شجر كبير يعيش في التربة الرطبة ويزرع على جانب الطريق");
  add("جيفك", "	32 : 5	", "جثث الموتى المتعفنة");
  add("جوج", "	38 : 2" , "إسم لملك بربري متوحش ودموي");
  add("ماجوج", "38 : 2	", "إبن يافث وهي الأرض التي يسكنها جو");
  add("عضائده","40 : 9	", "ناصره أو عاونة");
  add("مجزع","	40 : 17	", "رصيف الرواق  وتشير إلى نوع من الرخام المجزع");
  add("المآزيب","40 : 43", "خطاطيف التي تعلق وتمسك منها الذبيحة ");
  add("الأفاريز","41 : 26", "الألواح الخشبية المغشية للبيت من الداخل");
  add("فتر", "43 : 13	", "المسافة الممتدة من السبابة إلى رأس الإبهام");
  add("حاشيتة","43 : 13	", "برواز كسور يدور حول الحضن");
  add("الحضن","43 : 14	", "جزء الأساس الملامس للأرض مباشرة وهو القاعدة الأساسية التي يستقر عليها المذبح");
  add("الخصم", "43 : 14", "المقعد");
  add("إيفة","45 : 10", "كيال للحبوب والدقيق ( نفس حجم البث)" );
  add("بث","45 : 10", "مكيال السؤال (نفس حجم الإيفة)" );
  add("حومر", "45 : 11	", "= 10 إيفة أو بث");
  add("الشاقل", "45 : 12	",  "وحدة أوزان المعادن");
  add("جيرة", "	45 : 12	", "وحدة أوزان");
  add("هيناً", "	45 : 24	","مكيال سعته 7 لتر ");
  add("نافلة", "	46 : 12	", "عطية إختيارية وهذه يقدمها الرئيس");
  add("يهوه شمة", "48 : 35" , "الله هناك");
}


}

Utilities Utils;
